models/deepseek-v2-lite-2p2d/benchmark_results/p50_2p2d_20260318_013208/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f8102960fe0>, seed=7, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_2p2d_20260318_013208', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-7cd307cb-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-18 01:32:30 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [00:32<00:00,  3.07it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  32.62     
Total input tokens:                      1386900   
Total generated tokens:                  25200     
Request throughput (req/s):              3.07      
Output token throughput (tok/s):         772.49    
Peak output token throughput (tok/s):    1215.00   
Peak concurrent requests:                66.00     
Total token throughput (tok/s):          43286.92  
---------------Time to First Token----------------
Mean TTFT (ms):                          2601.03   
Median TTFT (ms):                        2637.06   
P50 TTFT (ms):                           2637.06   
P90 TTFT (ms):                           3768.24   
P95 TTFT (ms):                           3971.36   
P99 TTFT (ms):                           4542.68   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.08     
Median TPOT (ms):                        37.40     
P50 TPOT (ms):                           37.40     
P90 TPOT (ms):                           39.86     
P95 TPOT (ms):                           39.88     
P99 TPOT (ms):                           40.00     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.08     
Median ITL (ms):                         37.56     
P50 ITL (ms):                            37.56     
P90 ITL (ms):                            41.32     
P95 ITL (ms):                            42.62     
P99 ITL (ms):                            45.89     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          12158.93  
Median E2EL (ms):                        12242.72  
P50 E2EL (ms):                           12242.72  
P90 E2EL (ms):                           13598.25  
P95 E2EL (ms):                           13783.51  
P99 E2EL (ms):                           14120.36  
==================================================